Code_examples/rails/diary/app/controllers/entries_controller.rb

	def show
		@entry = Entry.find(params["id"])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ? LIMIT 1  [["id", 1]]

	def create
  		#render(:text => params.inspect)
  		entry_params = params["entry"].permit("title", "contents")
  		entry = Entry.create(entry_params)
---
INSERT INTO "entries" ("contents", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["contents", "this is some text oh yes"], ["created_at", "2014-11-15 01:35:16.046914"], ["title", "test 4"], ["updated_at", "2014-11-15 01:35:16.046914"]]

	def edit
		@entry = Entry.find(params["id"])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ? LIMIT 1  [["id", 4]]

	def update
	  entry_params = params["entry"].permit("title", "contents")
	  entry = Entry.find(params["id"])
	  entry.update(entry_params)
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "entries" SET "contents" = ?, "updated_at" = ? WHERE "entries"."id" = 4  [["contents", "this is some text oh no"], ["updated_at", "2014-11-15 01:43:38.179785"]]